<h1 style="text-align:center; font-size:160%; font-family:verdana;color:#F44A79;"><em>Date 21-06-2021</em></h1>

<h1 style="text-align:center; font-size:360%; font-family:verdana;color:#4A3E76;"><em>Selecting Columns</em></h1>

In [1]:
import pandas as pd

In [2]:
titanic_data_csv=pd.read_csv('titanic_data.csv')
titanic_data_csv

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [3]:
titanic_data_csv['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [4]:
titanic_data_csv[['fare']]

        fare
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
..       ...
886  13.0000
887  30.0000
888  23.4500
889  30.0000
890   7.7500

[891 rows x 1 columns]

In [5]:
type(titanic_data_csv['fare'])

pandas.core.series.Series

In [6]:
type(titanic_data_csv[['fare']])

pandas.core.frame.DataFrame

In [7]:
titanic_data_csv[['fare','sex','embarked']]

        fare     sex embarked
0     7.2500    male        S
1    71.2833  female        C
2     7.9250  female        S
3    53.1000  female        S
4     8.0500    male        S
..       ...     ...      ...
886  13.0000    male        S
887  30.0000  female        S
888  23.4500  female        S
889  30.0000    male        C
890   7.7500    male        Q

[891 rows x 3 columns]

In [8]:
type(titanic_data_csv[['fare','sex','embarked']])

pandas.core.frame.DataFrame